Revit 2026 API

# UVIsAlmostEqualTo(UV, Double) Method

---

Determines whether this 2-D vector and the specified 2-D vector are the same within a specified tolerance.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsAlmostEqualTo(
	UV source,
	double tolerance
)
```
```vb
Public Function IsAlmostEqualTo (
	source As UV,
	tolerance As Double
) As Boolean
```
```cpp
public:
bool IsAlmostEqualTo(
	UV^ source,
	double tolerance
)
```
```fsharp
member IsAlmostEqualTo :
        source : UV *
        tolerance : float -> bool
```

#### Parameters

source UV
    The vector to compare with this vector.
tolerance Double
    The tolerance for equality check.

#### Return Value

BooleanTrue if the vectors are the same; otherwise, false.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when source is . |
| ArgumentException | Thrown when tolerance is less than 0. |

#### Reference

UV Class

IsAlmostEqualTo Overload

Autodesk.Revit.DB Namespace